{
  "questions": [
    {
      "title": "Create an Account",
      "text": "Try to create an account in the web application using your email address. You can do this by opening the menu bar (i.e. 3 lines) and by clicking on 'account'. You will be redirected to a page on which you can create a new account. Once you do that you will be redirected to the homepage and receive an email to verify your account."
    },
    {
      "title": "Verify your Account",
      "text": "After creating your account, please access your emails and have a new email from chemicaltwinsrug@zohomail.eu with a link to verify your account. After clicking on the link and you will be redirected to the homepage with a notification that your account is now verified."
    },
    {
      "title": "Login",
      "text": "After vefication, login the website with your email and password. In the menu bar you should see your username displayed there \n along with some links that you weren't previously able to see."
    },
    {
      "title": "Edit your account",
      "text": "After you've logged into your account you should be able to view different links in the menu.\nClick on the 'edit account' and change your username through that (you don't need to also change your password so you can leave that empty). Once you have done that open the menu again and you should now see a different name displayed on top of the menu."
    },
    {
      "title": "Logout",
      "text": "Now open on the menu once more and logout from the website through the 'logout' button. You should receive a message confirming that you have logged out successfully."
    },
    {
      "title": "Password reset",
      "text": "Now, after you logged out of the website, please go again to the 'account' page. Under 'login' click on 'Click Here' to open a new form to reset your password. \nInput the email you used to create your account and click on 'send email'. After, please check whether you received a new email from chemicaltwinsrug@zohomail.eu \nThe link in the email will bring you to a new page where you can set a new password. Please do that and after try to login again with your new password."
    },
    {
      "title": "Start Stream",
      "text": "For the following step, please make sure that you are logged into your account. Scroll to the bottom of the Homepage and click on 'create live' (note: you will need to give access to your camera for that). \nFill in the form with whatever you want but keep in mind the room name and password you set. Complete the form and you should be redirected to a live streaming page."
    },
    {
      "title": "Test Mute/Hide",
      "text": "Now try to use the buttons to hide your camera and mute the stream."
    },
    {
      "title": "Save Recordings",
      "text": "Now try to record your stream. Click on the record button and let it run for a couple of seconds at least. Then press on 'stop' and then 'save recording'.\n You should then be able to download a .mp4 file with your video and a .json file with the experiment data."
    },
    {
      "title": "Join The Stream",
      "text": "Now open a new tab on a different browser or in incognito mode. Go to the website and login with the following credentials.\n Email: student@gmail.com, Password: Experiment1 \n. Once you've done that click on 'Join live' and input the room name and password you used on your other page (provided that you didn't end the stream).\n Now you will be able to see your stream from this account too. "
    },
    {
      "title": "Check connected users",
      "text": "Please open the sidebar on right side of the stream and look at the 'user list'. Check whether you can see you own name and the student account."
    },
    {
      "title": "Ask Questions",
      "text": "From your main account (the one that created the live stream) now click on the 'ask question' button. After, type a question in the 'question' box. Then click on the 'Add Answer' button, type in a number and add the number to the answer option through the green '+' button. Now click on the ask button. \n Now in the other account you should see the question you just ask along with the answer choice you gave."
    },
    {
      "title": "Answer and Save Question",
      "text": "From the 'student' account choose an answer and click on the 'answer' button to submit your answer. After go back to your main account and you should be able to see the answers to the question (if not click on 'Show Answers'). Click on 'Save' and you should see a message telling you that the answers were saved correctly."
    },
    {
      "title": "Leave Stream",
      "text": "On the 'student' account leave the live stream by clicking on 'leave' button (under the video). Now you can close this tab and go back to the livestream from your main account. Please check again the 'user list' on the right side bar and you will now only see your username now."
    },
    {
      "title": "End Stream",
      "text": "Please click on 'end stream' (under the video) and a message from the application will tell you that the room was deleted correctly and send you back to the homepage."
    },
    {
      "title": "Upload Experiment",
      "text": "In this folling step you will upload a video and data file on website. To do that, save the following video and data file. On the Homepage, click on 'upload experiment' and upload the video and data that you just downloaded and fill the rest of the form however you prefer. \n Click on 'Upload' and after you will be redirected to the homepage with a confirmation message saying that the experiment was uploaded correctly.",
      "files": "Yes"
    },
    {
      "title": "Past Experiments",
      "text": "Go to the homepage and click on 'Past Experiments' and you will be redirected to a page with some previously uploaded experiment. Click on the name of one of them and then play it. You will now be able to see the video along with collected data on a graph."
    },
    {
      "title": "Search Experiment",
      "text": "Go again to 'Past Experiments' and this time search for the name of an experiment and press 'enter'. Now you do you will see a list of experiments that contain you searched words in their title (the list can also be empty if no experiment match your search)."
    },
    {
      "title": "Delete your account",
      "text": "While logged in open the menu, go to 'edit account' and click on 'delete your account'. You will now be logged out. If you try to login again this should not work."
    }
  ]
}
